#+TITLE: Live Pod Migration
#+DATE: <2026-04-17 Fri>


A short demo of live migrating pods between nodes via CRIU Checkpoint & Restore in Userspace.


* Prerequisites

- [ ] An OpenShift Cluster with cluster admin permissions, these instructions have been tested with OpenShift ~4.21~.

- [ ] The ~oc~ command line tool available in your path. Before we begin, let's ensure we are logged into the cluster with ~oc~:

#+NAME: Login to openshift cluster
#+begin_src bash
source .env
oc login "${OCP_API_URL}" --username "${OCP_USERNAME}" --password "${OCP_PASSWORD}" --insecure-skip-tls-verify
#+end_src

#+RESULTS: Login to openshift cluster
#+begin_example
WARNING: Using insecure TLS client config. Setting this option is not supported!

Login successful.

You have access to 79 projects, the list has been suppressed. You can list all projects with 'oc projects'

Using project "default".
#+end_example


** Compile checkpointctl

Now that we've demonstrated the concepts manually let's demonstrate how checkpoint and restore can work in kubernetes. To do so we'll be using the ~checkpointctl~ cli utility, we need to compile that from source:

#+NAME: Compilation requirements
#+begin_quote
Note: This guide assumes your system will have a modern go version and the required dependencies (asciidoctor) to compile ~checkpointctl~. Follow the directions in the [[https://github.com/checkpoint-restore/checkpointctl][checkpointctl]] README.md.
#+end_quote

#+NAME: Install checkpointctl
#+begin_src bash
git clone --depth 1 https://github.com/checkpoint-restore/checkpointctl
cd checkpointctl && make
./checkpointctl --help
#+end_src

#+RESULTS: Install checkpointctl
#+begin_example
make: Nothing to be done for 'all'.
checkpointctl is a tool to read and manipulate checkpoint archives as created by Podman, CRI-O and containerd

Usage:
  checkpointctl [command]

Available Commands:
  build       Create an OCI image from a container checkpoint archive
  completion  Generate the autocompletion script for the specified shell
  diff        Show changes between two container checkpoints
  help        Help about any command
  inspect     Display low-level information about a container checkpoint
  list        List checkpoints stored in the default and additional directories
  memparse    Analyze container checkpoint memory
  plugin      Manage checkpointctl plugins
  show        Show an overview of container checkpoints

Flags:
  -h, --help      help for checkpointctl
  -v, --version   version for checkpointctl

Use "checkpointctl [command] --help" for more information about a command.
#+end_example


** Deploy sample pod

Let's now create the sample pod we'll use to demonstrate checkpoint and restore. It's a simple bash counter that will demonstrate resuming where the counter has left off.


#+begin_src bash
cat << 'EOF' | oc apply --filename -
apiVersion: v1
kind: Pod
metadata:
  name: counters
  namespace: default
spec:
  containers:
    - name: counter
      image: busybox:latest
      command: ['sh', '-c', 'i=0; while true; do echo $i; i=$((i+1)); sleep 1; done']
EOF
#+end_src

#+RESULTS:
#+begin_example
pod/counters created
#+end_example


We can view the logs of the runniing counter as follows:

#+NAME: Check pod logs
#+begin_src tmux
oc --namespace default logs --container counter counters
#+end_src


** Optional checkpoint analysis

With the checkpoints copied to our local machine we can take a sneak peek before we restore.

#+NAME: Inspect pod checkpoint
#+begin_src bash
./checkpointctl/checkpointctl inspect checkpoints/*
#+end_src

#+RESULTS: Inspect pod checkpoint
#+begin_example

Displaying container checkpoint tree view from checkpoints/checkpoint-counters_default-counter-2026-04-22T22:30:17Z.tar

counter
├── Image: docker.io/library/busybox:latest
├── ID: 61ea9726d52ad7fa0ddea79f742d45be20161d1d79b5151103347afc296ba2f7
├── Runtime: crun
├── Created: 2026-04-22T22:03:03.039247459Z
├── Checkpointed: 2026-04-22T22:30:17Z
├── Engine: CRI-O
├── IP: 10.234.0.10
├── Checkpoint size: 305.5 KiB
│   └── Memory pages size: 292.0 KiB
└── Root FS diff size: 4.5 KiB

#+end_example


